[
{"title": "Podcast: Global chip shortage affects Apple and the iPhone", "contents": ["The semiconductor shortage has wreaked havoc on manufacturers, and Apple will soon feel pinch. In the company's Q3 earnings call, chief executive Tim Cook said that supply constraints around \"legacy nodes\" will affect iPhone sales. These \"legacy nodes\" include chips for the display, ports and audio, not the A- and M-series processors that Apple designs for its devices. Macworld executive editor Michael Simon and Computerworld executive editor Ken Mingis discuss how the chip shortage will affect Apple, why Apple is considering using its own chips in monitors and other revelations from the earnings call."], "url": null},
{"title": "How Valley Behavioral Health uses Slack in a regulated industry", "contents": ["Team collaboration tools have become popular in a variety of sectors in recent years, replacing email with group chat “channels” for real-time communication. For Valley Behavioral Health, that's meant using Slack to improve the flow of information between staffers while ensuring that patient data remains protected.", "Although it's largely a Microsoft shop, the Utah-based mental health services provider uses Slack’s Enterprise Grid for internal communications among its 750 employees, connecting doctors, therapists, social workers and other staff members.", "Valley Behavioral Health has channels for care coordination and a broad range of other purposes, from HR-related queries to property management issues (users can upload a photo of faulty equipment in office buildings, for example) to IT ticket submission. There’s also a  “general” channel allows for informal conversations between colleagues.  ", "“It's a real hub of communication around our entire business,” said Valley Behavioral Health CIO Tyler Tait in a recent interview.", "As an organization operating in a highly regulated area — healthcare — Valley Behavioral Health must manage protected health information (PHI) sent by staff that use a digital communication platform.", "Although not initially aimed at regulated industries, Slack's Enterprise Grid — announced in 2018 — can be configured for compliance with the Health Insurance Portability and Accountability Act (HIPAA), thanks to the addition of encryption and data protection capabilities.", "With Enterprise Grid, Valley Behavioral Health’s PHI data is encrypted at rest and in transit on Slack’s servers and can be saved on its own encrypted drives. For audit purposes, it’s possible see what PHI was shared, with whom, and when.  ", "There have been practical advantages for staff. HIPAA compliance allowed Valley Behavioral Health workers to send messages containing PHI information in certain channels, enabling faster communication across the organization, said Tait. As an example, he pointed to parents who routinely pick up their child from Valley Behavioral Health’s school for children with autism. When staff are informed of a parent’s arrival, the chat message containing the name of their child could be considered sensitive patient data.", "Valley Behavioral Health CIO Tyler Tait.", "“They need to be able to say which child — you can't just say the client ID,” Tait said. “We were able to make it more effective: it was an easier, immediate way for them to communicate.” ", "Even so, Valley Behavioral Health warns its staff to avoid sharing PHI over Slack unless necessary, with PHI not allowed in the “general” channel, for instance.", "“It was huge for us to be able to allow folks to be able to put PHI into Slack; that's been great for the specific times and use cases where it's been necessary. But the bottom line is that we tell folks, ‘If you don't need to share any patient information in Slack, then don't,’” he said. Instead, PHI is shared in small private groups or direct messages between individuals, where appropriate.", "There are other ways Valley Behavioral Health protects patient information. It keeps third-party integrations to a minimum to reduce the risk of data being moved to external providers. It has also opted against integrating Slack with its electronic medical records (EMR) system, to keep patient data separate from the collaboration platform.", "“Slack is a communication tool to keep people engaged: it's immediate, it's completely up to date, and it keeps everybody ‘in the know,’” he said. “I wouldn't necessarily think of it as a file or data repository for information, even though it is HIPAA-compliant.”", "While team collaboration tools are not widely used in healthcare, said Seth Feder, senior director analyst for healthcare at Gartner, interest is growing. That's a reflection, in part, of the broader maturity of health IT environments following the widespread adoption of EMR systems over the past decade.", "Although major EMR software vendors have message capabilities built into their platforms, these don’t offer the functionality that a dedicated communication and collaboration can provide.  “[A] common complaint we hear is EMR vendors can’t keep up with the level of innovation seen by third-party tech companies that focus on particular solutions,” he said. “Thus, replicating the Slack experience is difficult.” ", "Having relied on a team collaboration software for several years, Valley Behavioral Health was well placed last year when it had to support remote work during the onset of the COVID-19 pandemic, according to Tait. That shift took place with minimal disruption and no drop-off in productivity.", "“We could see what was going on with the channels before and after, and just as much work was getting done; there was just as much activity,” Tait said.", "One of the ripple effects of the pandemic and the move to more remote work has been a greater reliance on mobile devices, both in terms of laptops and smartphones. Previously, Slack had mainly been accessed on desktop devices.", "“That’s when we made a big push: we said that we've got to make this accessible on people's smartphones,” said Tait.", "Now mobile access is firmly embedded in Valley Behavioral Health’s collaboration strategy. “Part of our onboarding process is to install Slack on everybody's phone,” said Tait. “We tell our employees that, just as a car is required to come to work, a smartphone is necessary for them here to be able to work.", "“That's been a major difference; that means everybody is much more accessible to get Slack messages, and communication can be much more effective.”"], "url": "https://images.idgesg.net/images/article/2021/07/mbp_2760-100896013-large.jpg"},
{"title": "Windows 365 — Microsoft’s cloud-based OS explained", "contents": ["Microsoft last week introduced ", ", a new service that lets the company cut partners out of the money-making loop by providing virtual PCs to customers.", "Rather than provide only the operating system or the OS and bits of other software — notably productivity applications in the form of Office — Microsoft will soon also serve up ersatz hardware, virtual machines running on its vast cloud of Azure servers.", "Dubbed \"desktop as a service\" (DaaS, in keeping with other, similar acronyms) by some, Microsoft's ", " as in \"Windows 365 is your PC in the cloud.\"", "\"Just like applications were brought to the cloud with SaaS, we are now bringing the operating system to the cloud, providing organizations with greater flexibility and a secure way to empower their workforce to be more productive and connected, regardless of location,\" said Microsoft CEO Satya Nadella in a statement.", "While DaaS in general, and Windows 365 specifically, has the ", " to dramatically change how computing takes place in commercial settings, there's nothing inevitable about it. Many will object to ceding the privacy of a local box to the servers of, in this case, Microsoft, for example.", "And Microsoft, already active in PC manufacturing with its Surface line — originally touted as examples for OEMs, something that's been discarded as a talking point — puts itself into further conflict with hardware partners with Windows 365. When the desktop is streamed, what purpose does a high-powered laptop-on-the-lap serve? Will OEMs be relegated to making cheap Chromebook-like machines that need only run a browser?", "Windows 365 is really a developing story, as Microsoft has promised to elaborate as the early-August launch nears. But we've assembled a first-pass set of questions and answers.", "At its simplest, it's a virtualization service that provides a Windows desktop and first- and third-party applications to users with both PC and non-PC hardware.", "Maybe it's better to think of it as a streaming service. Rather than stream movies and TV shows, it streams the output of a Windows 10-, or when it's available, a Windows 11-powered PC. The controller is the keyboard, touchscreen, mouse, even the microphone of whatever device is in front of the user.", "It's also the latest incarnation of the ", " model, which harks to the beginnings of digital computing when the computer was massive and cost multi-millions — and endpoints were unintelligent terminals. Like that model, Windows 365 runs the virtual desktop on servers at a distance; the data is transferred over the Internet rather than an organization's network.", "Microsoft says to expect Windows 365 on Aug. 2.", "That's for business. It's likely that Microsoft will offer the service to consumers and very small shops — sole proprietorships, say — at some point. But that's not going to happen right out of the gate.", "We don't know because that's one of the details Microsoft withheld.", "Here's what we do know: Microsoft will charge a flat monthly rate per user, rather than basing the cost on the amount of activity, as in the amount of Azure resources consumed.", "Microsoft listed a dozen possible virtual machine configurations, from the most basic (2 cores, 4GB of memory and 64GB of storage) to the more advanced (8 cores, 32GB RAM and 512GB of storage space). It will almost certainly price these configurations from low to high.", "Although Microsoft listed 12 configurations, it collected them into just 5 groups. It's possible, then, that there may be as few as 5 different price points for Windows 365 licenses.", "One pricing hint came from ", "'s ", ", who spotted a $31 per user per month cost for the 2-core, 4GB memory and 128GB storage option. That would be $372 annually. Ouch.", "No, though it's easy to see it that way.", "The Microsoft 365 license gives you the right to ", " the included software, among that collection Windows 10 (and down the road, Windows 11). The Windows 365 license pays for the ", " Microsoft's built, and Microsoft maintains on its servers that ", " the operating system you paid for.", "It's no different than if you were on a physical PC. You paid for that with one invoice. You paid for the Microsoft 365 license with another.", "Part of the problem, as we see it, is Microsoft's damn-the-torpedoes belief that everything possible should be stuck with the ", " suffix. Office first, then Microsoft, and now Windows. Sheeze. There's going to be endless confusion among these terms, notably Microsoft 365 and Windows 365, since to many, Windows = Microsoft and vice versa.", "While their number is not legion, they are many. Conveniently, they break down into two categories: Licensing and Other.", "Remember, you asked for this.", "Again, from Microsoft's mouth, they are:", "Nope. Microsoft made it clear that where 10 goes, so will follow Windows 11.", "It's safe to assume that Windows 10-powered \"Cloud PCs\" — Microsoft's name for the virtualized desktops — will be supported through the end of the operating system's lifecycle, which has been set as October 2025. It's also a gimme that organizations will be able to run both 10- and 11-powered virtual PCs in their environments simultaneously.", "Good question.", "Microsoft certainly ", ", since the \"devices\" are on their servers. And for some instances, say if or when Microsoft opens this concept to owners of Windows 10 Home/Windows 11 Home, maybe that's how it'll work.", "But while ", " couldn't find any clear evidence once way or another, our suspicion is that customers will continue to be responsible for updating upkeep. And that's as it should be. There's no easier way to get IT to squawk than to take control of an org's technology out of its hands.", "The clues lie in the frequent reference to Microsoft's tools for managing physical systems and how they will serve the same roles for cloud PCs. \"IT can easily procure, deploy and manage Cloud PCs for their organization just as they manage physical PCs through Microsoft Endpoint Manager,\" the company promised in its statement about the program.", "Not surprising, Microsoft's own cloud computing platform, Azure. Specifically, ", " (it was known as Windows Virtual Desktop until June), which can be used to create Windows virtual machines on Redmond's servers, then stream those desktops to PC and non-PC devices.", "Windows 365, Microsoft repeatedly said, is essentially an automated Azure Virtual Desktop, in that the former handled all the scut work of creating and assigning the virtual machines, slapped an analytics package on the result and offered a one-stop dashboard for admins.", "Elsewhere, Microsoft characterized Windows 365 as a way for admins unfamiliar with virtualization (or hesitant to learn) to call on Azure Virtual Desktop.", "Microsoft hasn't issued a declarative list, but in its many musings on Windows 365 it's mentioned everything from Windows 10- and 11-powered PCs, Macs (including, one has to assume, those with Apple's native silicon) and Linux machines to iPhones, iPads and Android devices. Presumably, Chromebooks will be in there somewhere, too.", "Any device able to run a web browser should be able to act as a Windows 365 endpoint; in-browser is one of the two ways to stream a desktop. The other? Through Microsoft Remote Desktop already extant for the likes of iOS and Android.", "Microsoft's not been specific.", "What it did say was purposefully vague. \"If you can stream a movie, you have enough bandwidth for a great experience,\" Scott Manchester, director of program management for Windows 365, said in a ", ". (Manchester was the very public face for Windows 365's debut.)", "At what resolution would be our first question. And how irritating will it be to see your PC put up the maddening ", " icon when your connection's speed isn't sufficient?", "Here's hoping that Microsoft gets specific before or at the Aug. 2 launch."], "url": "https://images.idgesg.net/images/article/2021/07/microsoft-windows-365-all-apps-100895442-large.jpg"},
{"title": "Microsoft Teams users get license-free access to Dynamics 365 data", "contents": ["Microsoft Teams users can now access Dynamics 365 data without the need for licenses for the CRM platform.", "Microsoft has already moved in recent months to deepen ties between Dynamics 365 and the team collaboration app; in March, the company added the ability to embed Teams chat into the Dynamics 365 app, while improving access to data from within Teams.", "At its ", ", Microsoft announced that all Teams users will now have access to Dynamics data from within the collaboration app, regardless of whether they have a Dynamics 365 license. Admins will be able to set permission and access rules to restrict access to customer records.", "“Dynamics 365 users can now invite anyone in the organization to view and collaborate on customer records right within the flow of a Teams chat or channel,” Jared Spataro, corporate vice president for Microsoft 365, ", ".", "By eliminating the “licensing tax” that had previously held customers back from using the available integration, CRM data can be shared among more employees, he said. That would allow sales and customer service employees to interact with colleagues who don’t routinely use the CRM tool, allowing finance teams to share purchase order and payment details with sales staff, for example.", "The announcement “helps to reinforce the growing links that Microsoft is keen to establish between Teams and Dynamics 365,” said Angela Ashenden, principal analyst at CCS Insight. It can also help Dynamics 365 customers drive broader adoption, without the need to invest in additional licenses for casual or irregular users, she said.", "Wayne Kurtzman, research director at IDC, said that Microsoft is positioning Teams as the “launching point” for employees to get work done. “While it is a work in progress with some UI challenges, the integration of Dynamics 365 signals Microsoft's view of the importance of collaboration in the enterprise — and for all workers and across all devices,” he said. ", "Microsoft also announced that Dynamics users can now add a Teams meeting when creating an appointment and capture and save notes from a Teams meeting for later access in the timeline of the Dynamics record.", "Broader integration of Teams has been a growing priority for Microsoft. This includes ", ", announced in January, that lets SAP users share information such as supplier details with colleagues without switching screens.", "Earlier this month the ", ", giving sales and service teams that use Salesforce Sales Cloud and Service Cloud access to data from Microsoft’s collaboration app.", "Microsoft’s CRM rival Salesforce appears set to follow a similar path by integrating its core business software products with Slack – a competitor to Microsoft Teams. Salesforce announced plans to ", ", with that deal set to close later this month.", "By continuing to tie Teams and Dynamics more closely together, Microsoft can strengthen its position against Salesforce and Slack, once that deal goes through.  ", "“Ultimately, I think it’s likely that Teams will become the default interface (or at least entry point) for Dynamics 365 for most users, further blurring the line between collaborative applications and line-of-business apps in the Microsoft portfolio,” said Ashenden.", "“Given the success of Teams, it’s easy to see why Microsoft would want to drive this, and given the acquisition of Slack by Salesforce, it’s a trend that’s going to become the norm pretty soon.”"], "url": "https://images.idgesg.net/images/article/2021/07/picture2-60e83125c0e41-1024x605-100895774-large.jpg"},
{"title": "Windows 11: Déjà vu all over again?", "contents": ["For longtime Microsoft watchers, there might have been a moment of déjà vu last month as the Redmond, Wash. developer announced its upcoming Windows 11 operating system.", "The moment? When they read this line in the company's official ", ": \"If you're currently shopping for a new PC look for 'Free upgrade to Windows 11' on the fact tag.\"", "A decade and a half ago, Microsoft used something similar to market the PCs that were supposed to run its then-impending Windows Vista, with stickers at retail and labels online stating which machines were \"Vista Capable.\"", "That 2006 campaign was a disaster for Microsoft. A ", " with the Vista Capable program, which led to the release of embarrassing internal emails in which executives blasted the campaign and expressed frank opinions about the OS itself.", "The company created the Vista Capable program to maintain PC sales momentum, notably during the holiday season of 2006, as the January 2007 launch of Vista neared. As revealed in court documents, ", ", which needed to unload inventory, by lowering system requirements to include a bottom-level Intel graphics chipset.", "Internally, some at Microsoft balked at the change in system requirements, ", " and telling personal tales of spending thousands on a system that, in the end, couldn't run Vista or couldn't deal with Vista's advanced features, including the new Aero UI (user interface).", "The lawsuit, which was awarded class-action status — dramatically expanding the pool of plaintiffs and, thus, the amount Microsoft might have to pay in damages assuming a loss — also revealed other bits of interest. An expert for the plaintiffs, for instance, estimated that ", " from the sale of licenses for PCs marked as \"Vista Capable\" in the months leading up to OS launch. Other estimates pegged ", " if a settlement was reached.", "There was no link between the Vista Capable debacle and the operating system's later ultimate failure. (Vista was adopted by about one in five Windows users at its peak, less than a third reached by the precursor Windows XP or the successor Windows 7.) But the disclosures couldn't have helped; they reinforced the reputation already being built for Vista, that it was an over-ambitious effort that needed a higher-horsepower PC.", "Huge numbers of users decided to stick with XP and ride that pony until it dropped in early 2014, then switch to Windows 7, skipping Vista.", "Windows 11 could experience similar headwinds because, like Vista, its system requirements are more exacting than its antecedent.", "\"This next generation of Windows will raise the security baseline by requiring more modern CPUs, with protections like virtualization-based security (VBS), hypervisor-protected code integrity (HVCI), and Secure Boot built-in and enabled by default to protect from both common malware, ransomware, and more sophisticated attacks,\" Microsoft said in a ", ".", "Windows 11's system requirements can be found ", " and ", ".", "The stumbling block will be the processor requirement, which Microsoft said — after some initial dissembling — would definitely put Intel's 8th-generation (and AMD's Zen 2) on the Windows 11-compatible side, with the possibility that 7th-generation (and Zen 1) will be as well. Anything earlier, and the device will be out in the cold.", "Bottom line: Some PCs sold relatively recently, say in the last three years, may not run the new OS.", "Microsoft couched the harsher requirements — relative to previous OS upticks, anyway — as necessary for security purposes. That's the case, too, with the requirement of TPM, or \"Trusted Platform Module,\" version 2.0, for its ability to securely store encryption keys and the like.  Microsoft called TPM 2.0 \"a critical building block\" for security and contended that \"PCs of the future need this modern hardware root-of-trust to help protect from both common and sophisticated attacks like ransomware and more sophisticated attacks from nation-states.\"", "All this led to confusion right from the start. Which PCs would run Windows 11? Which might? Microsoft botched the opening round so badly that it yanked a compatibility checker and rewrote (or clarified, your pick) pieces and posts about requirements multiple times, ", " that it was doing so, sometimes, well, without.", "Microsoft will not want to repeat the Vista Capable mistake with an official declaration on each PC. Instead, sellers will mark such systems with the \"Free upgrade to Windows 11\" phrase.", "Microsoft may clarify this, but if that's all the company will do for available PCs, it smacks of an obtuse and opaque maneuver meant to avoid responsibility. A label reading \"Free upgrade to Windows 11\" guarantees nothing about compatibility.", "The simplest solution would be to mark devices \"Will run Windows 11,\" but something that straightforward would risk a repeat of Vista Capable. No surprise — that's not the direction Microsoft went.", "OEMs (original equipment manufacturers) don't have the luxury of dodging the question. They're using an if-we-have-it-then-it-will-run-11 tactic to inform potential customers that their wares are capable of running Windows 11. Some have already done so.", ", tells customers \"Our current Windows-based PCs will be upgradeable to Windows 11 when it's available later this year,\" albeit with a caveat that some features require specific hardware. Likewise, ", ", \"All Dell PCs with Windows 10 currently being sold on dell.com will be able to upgrade to Windows 11\" on its website.", "Ironically, Microsoft hasn't followed the lead of Dell and HP; pages touting its own Surface line do not make the same claim that all will run the new OS. There is some copy about the compatibility checker, however, the one Microsoft withdrew and is reworking.", "It's no coincidence that Microsoft announced Windows 11 and the \"Cloud PC\" concept dubbed \"Windows 365\" within three weeks of each other.", "Unlike in previous OS turnovers, Microsoft has an end-around it can offer customers — commercial customers initially, but you can expect it to filter down to very small businesses/consumers later — who find themselves with hardware that can't meet the operating system's system requirements.", "According to Microsoft, the virtualized instances of Windows 11 that Windows 365 will create, store, and maintain on the firm's Azure service will stream to any device equipped with a browser and connected to a sufficiently fat pipe to the internet. The local PC, if that's what it is, could be powered by a not-suitable-for-Windows-11 6th-generation Intel processor, and it wouldn't matter.", " expects that Microsoft will use this to pitch Windows 365 to organizations that want to move to Windows 11 but that have a heterogeneous collection of desktops and laptops, some able to run the OS natively, some unable to as much as boot up 11. While Windows 11 could be deployed to the former, the latter would need to be physically replaced with newer devices ", " set up with Windows 365 licenses.", "Even if the organization intended to replace the aged PCs with newer, physical devices, Windows 365 could be used until their replacement cycles come around."], "url": "https://images.idgesg.net/images/article/2021/07/windows-11-on-pcs-100894692-large.jpg"},
{"title": "Zoom buys cloud contact center Five9 for $14.7B", "contents": ["Zoom yesterday ", " in a $14.7 billion all-stock transaction. Subject to shareholder approval, the acquisition is expected to close in the first half of 2022.", "The acquisition could allow the company to hedge its video bets after 18 months of unprecedented growth as both companies and individual users turned to the videoconferencing platform to stay in touch with co-workers, family, and friends. While the need for videoconferencing is unlikely to go anywhere, even with offices re-opening, Zoom appears to be looking to capitalize on its growing customer base by expanding services.", "Steve Blood, a VP Analyst at Gartner, raised questions about the move, noting that Five9 and Zoom operate in completely different markets. He sees a \"disconnect\" between the two companies and a potentially risky acquisition.", "“We recognize that a part of the market that Zoom targets is an IT leader in a mid-size business or smaller that has responsibility for all communication,\" Blood said. \"In that segment, it is very feasible that there will be a responsibility for buying contact center technology.", "“However, when you look at Five9’s business, they focus on a higher end of the market and a lot of their business is dealing directly with CX leaders who, from our experience, have nothing to do with enterprise collaboration whatsoever.,\" Blood said. \"That's where the disconnect is for us.\"", "Zoom CEO and founder, Eric Yuan, in a statement, pointed to the push for \"hybrid\" workplaces, and said Five9 would position Zoom to grow.", "\"The trend towards a hybrid workforce has accelerated over the last year, advancing contact centers’ shift to the cloud and increasing demand by customers for customized and personalized experiences,\" Yuan said. \"Today, enterprises not only need to enable customers to engage via their preferred channel, they need to empower their teams to accomplish more, and do so with empathy, purpose, and connection. We truly believe that together, we will enable customers to reimagine the way they do business and deliver exceptional results.\"", "Five9 is slated to become an operating unit of Zoom after the deal closes.", "Yuan said earlier this year that Zoom would be looking to expand its range of communications services. Although videoconferencing has remained its mainstay, the company has also launched office collaboration products including Zoom Phone, a cloud phone system, and conference software, Zoom Rooms.", "In an interview before the Five9 acquisition was announced, Magnus Falk, CIO Advisor at Zoom, said Zoom Phone is becoming an increasingly popular offering, with the company selling 500,000 units in the last quarter. By comparison, it took seven successive quarters to sell 1 million units.", "Rowan Trollope, the CEO of Five9, put it this way in a statement: “Businesses spend significant resources annually on their contact centers, but still struggle to deliver a seamless experience for their customers. It has always been Five9’s mission to make it easy for businesses to fix that problem and engage with their customers in a more meaningful and efficient way. Joining forces with Zoom will provide Five9’s business customers access to best-of-breed solutions, particularly Zoom Phone, that will enable them to realize more value and deliver real results for their business.\"", "Blood said he will be looking closely for several things to see whether the acquisition ultimately works to Five9’s benefit.", "“We will be looking for continuity of leadership, continuity of people in the product development space, and seeing that they can continue offering the things that [Five9 has] been previously delivering,” Blood said.", "He argued that a name change or a rebranding effort that moves Five9 toward the collaboration space  could be a turn off for customers. Five9 regularly scores highly in terms of customer satisfaction, Blood said, and has been rewarded with good ratings and solid growth.", "“If the whole Zoom thing becomes more of an emphasis, and Rowen [Trollope] gets dragged off, that loss of momentum could be the real turning point,” he said.", "The contact center-as-a-service space is growing, Blood said; it’s up 38% a year overall, with some vendors growing more than 100% — a level of growth he’s never seen in 30 years. ", "“If the Five9 business is able to focus on building out and strengthening its capabilities in customer experience, and where there is an opportunity, build something that would enable them to sell to small and mid-sized businesses as well, that would be good. If they lose that focus that’s gotten them to where they are today with CX leaders, then it's not going to be a great thing,” Blood said."], "url": "https://images.idgesg.net/images/article/2018/07/handshake_neon_sign_by_charles_deluvio_cc0_via_unsplash_1200x800-100765871-large.jpg"},
{"title": "Apple plans an all-5G iPhone range, but not until '22", "contents": [", but most users don’t yet really feel the benefit, given that network infrastructure and services are still being rolled out. But you can expect adoption on both fronts to accelerate into 2022.", "Let’s get to the bad new first: If a report on ", "is to true, Apple won’t introduce an all-5G iPhone range until 2022, when it is expected to also introduce an A15-powered iPhone SE with 5G, but no iPhone mini. The current iPad Pro range also features 5G, but we have no info on any plans to extend this to other models.   ", "The good news is that Apple’s decision to field 5G across all iPhones starting next year suggests the company expects the standard to be more widely available across every market by then. This makes sense and sits broadly in line with expectations, which have always anticipated the standard seeing significant deployment and use into 2023 and beyond.", "It also suggests that the faster ", " will see wider deployment in additional regions.", "What’s not in the news is Qualcomm. We know Apple had a dispute with Qualcomm that it eventually settled in 2019. We also know Apple ", " to continue to try to ", ". And we know that Apple ", " with Qualcomm, timed to take the two forward to 2025.", "We’ve also heard that Apple has always wanted to pack iPhones with its own self-developed 5G radios, though we don’t know how possible this is turning out to be.", "We did hear from analyst Ming-Chi Kuo recently, who claimed Apple plans to adopt its own custom-designed 5G chips ", " “at the earliest,\" which means every iPhone will continue using Qualcomm chips until then. An analyst at Barclays had previously predicted a 2023 introduction.", "We think these Apple 5G chips will benefit from the usual tight integration between hardware and software the company is so proud of. That may mean better battery life, network stability, and more consistent 5G performance on Apple devices.", "There’s more to this than chips. Apple’s plans essentially advance adoption of 5G, which should provide a new raft of opportunity for enterprises and service providers.", "Network slicing, SD-WAN and the evolution of private 5G network provision will expand, meaning some businesses will be better able to realize the benefits of mobile broadband when it comes to IoT, management, and cloud-based business services.", "In consumer markets, realities such as lossless Apple Music and high-resolution movies and gaming experiences will be better realized, while the company will certainly explore use of 5G to support next-generation services and devices, including ", ".", "Most enterprises with digital services to sell (B2C or B2B) should already be exploring how they can exploit 5G, though at present the addressable market is pretty small.", "The inconvenient truth is that even in 2021, Gartner ", " will have 5G, and while that’s still an addressable market on a global basis of millions, deployment and coverage remains inconsistent at this time.  And Apple ", ".", "“The combination of delayed smartphone replacements and the availability of lower end 5G smartphones are poised to increase smartphone sales in 2021,” said Anshul Gupta, senior research director at Gartner.", "The scenario changes at the end of 2021. By then, ", ", the number of 5G smartphones sold will exceed 750 million globally (16.7 million in 2019, 213 million in 2020 and 538 million in 2021). In other words, by the end of 2021, around 10% of the global population will own a 5G smartphone.", "That’s when things should become exciting, as that is more than a large enough number of people to justify sizeable investments in next-generation services. And, of course, as services come on stream in 2022 and beyond, this will put air under the wings of 5G smartphone sales into the mass market — just in time for Apple’s all-5G iPhone range.", "It will take many years but it ", " Apple will own some of the FRAND patents that ", ", which may ", ".", "If you thought losing the headphone port was brave, just wait to see how thin these things become without a power socket."], "url": "https://images.idgesg.net/images/article/2020/12/iphone-12-5g-logo-100871567-large.jpg"},
{"title": "Scary ‘malware-as-a-service’ Mac attack discovered", "contents": ["Another day, and it's time for another ", ": malware that can harvest keystrokes and log-ins and is available on the Darknet for only $49.", " claims to have identified the hack, which it is calling XLoader. Enterprise security specialists managing ", " (of which there are many) need to be aware of the new attack, as we’re told it can:", "The hack is being sold as a kind of \"malware-as-a-service\" for around $49 on Darknet, the researchers said. Hackers in 69 nations have requested it, and 53% of those to have fallen victim to it are based in the US.", "The attack vector’s simple: Victims are tricked into downloading the malware using maliciously crafted Word documents.", "XLoader is derived from an existing Windows malware called Formbook, which is the ", ". Formbook has seen use in broad spam campaigns aimed at larger global organizations. (Somewhat confusingly, there’s also an Android malware called XLoader, which isn’t the same thing.)", "“Historically, MacOS malware hasn’t been that common,” said Yaniv Balmas, head of cyber research at Check Point Software in a statement. “They usually fall into the category of ‘spyware,' not causing too much damage. I think there is a common incorrect belief with MacOS users that Apple platforms are more secure than other more widely used platforms. While there might be a gap between Windows and MacOS malware, the gap is slowly closing over time. The truth is that MacOS malware is becoming bigger and more dangerous.”", "This is true, of course. But at least one survey shows that despite the growing security threat, most enterprises see the Mac as ", ".", "Apple has a ", ", which means its platforms are seen as a potentially rewarding target. To be fair, it is also working constantly to ", ".", "“Our recent findings are a perfect example and confirm this growing trend,\" said Balmas. \"With the increasing popularity of MacOS platforms, it makes sense for cyber criminals to show more interest in this domain, and I personally anticipate seeing more cyber threats following the Formbook malware family. I would think twice before opening any attachments from emails I get from senders I don’t know.\"", "Apple’s software engineering chief, Craig Federighi, recently argued that Macs aren’t yet as secure as iOS devices: \"iOS has established a dramatically higher bar for customer protection,\" he said. \"The Mac is not meeting that bar today.\"", "The Apple exec also confirmed that the scale of Mac malware is accelerating. More than 130 different malware items have affected as many as 300,000 Macs, he said. A recent ", " claimed 670,273 new malware samples were identified in 2020, compared to 56,556 in 2019.", "With approximately 200 million users running macOS in 2018 (as reported by Apple), the Mac is a promising market for malware. Apple ", ", of course, as does the wider Apple ecosystem.", "MDM vendors such as Jamf are developing smart software solutions to ", ", though it's", ", which is why every enterprises should invest in security awareness and response training for all staff, and foster a culture in which mistakes, once made, are swiftly and non-punitively disclosed and responded to.", "Xloader uses a typically classic \"infection through dodgy Word document\" attack vector, which means it can also be mitigated against through the traditional approach to security protection:", "The researchers claim that one way a Mac user can check for this malware on their system is as follows:", "The researchers also recommend installation and use of malware detection software as this will often do a better job of identifying suspicious files."], "url": "https://images.idgesg.net/images/article/2020/08/what-is-malwarebytes-100854499-large.jpg"},
{"title": "iPhone spyware: It's a dirty job, but NSO's gonna do it", "contents": ["Amnesty International has revealed that NSO Group, an Israeli ‘surveillance as a service’ company, has created and sold ", " that can be used to spy on journalists, activists, and political representatives using their iPhones.", "What makes this ", " particularly dangerous is its exploitation of zero-click vulnerabilities, meaning targets don’t even need to read or open the iMessage carrying the hack. Amnesty says all iPhones and iOS updates are vulnerable to the exploit, which gives attackers “complete access to the device’s messages, emails, media, microphone, camera, calls and contacts.”", "“Apple prides itself on its security and privacy features, but NSO Group has ripped these apart,\" Danna Ingleton, deputy director of Amnesty Tech, said in a statement. \"Our forensic analysis has uncovered irrefutable evidence that through iMessage zero-click attacks, NSO’s spyware has successfully infected iPhone 11 and iPhone 12 models. Thousands of iPhones have potentially been compromised. ", "Bill Marczak, a research fellow at academic research lab Citizen Lab, ", " NSO Group continues to develop its spyware product. He calls this a “MAJOR blinking red five-alarm-fire problem with iMessage security.”", "You can read Amnesty’s ", ".", "Amnesty has identified at least 180 journalists in 20 nations who were targeted, including in Azerbaijan, Hungary, India and Morocco. The list even includes the editor of the ", ".", "The report also claims to have ", " that Pegasus was used by Saudi operatives to target family members of murdered Saudi journalist Jamal Khashoggi. NSO Group denies this, though it is unclear ", ", given it also claims to have no access to the data of its customer’s targets.", "It says its own internal investigation confirmed its tech wasn’t used against Khashoggi. I suppose it comes down to how deeply you trust a private company that sells surveillance as a service.", "Amnesty doesn’t think much of the rebuttal. “NSO claims its spyware is undetectable and only used for legitimate criminal investigations,” said Etienne Maynier, a technologist at Amnesty International’s Security Lab. “We have now provided irrefutable evidence of this ludicrous falsehood.\"", "“The number of journalists identified as targets vividly illustrates how Pegasus is used as a tool to intimidate critical media,\" said Agnès Callamard, secretary general of Amnesty International. \"It is about controlling public narrative, resisting scrutiny, and suppressing any dissenting voice.\"", "As you might expect, Apple has responded to the news. Security engineering chief Ivan Krstić said in a statement: \"Attacks like the ones described are highly sophisticated, cost millions of dollars to develop, often have a short shelf life, and are used to target specific individuals.”", "All of this is true, of course. Apple continues to improve security across all its platforms and its position on privacy is crystal clear — it wants privacy baked in ", ".", "Apple CEO ", ":", "“We see vividly—painfully—how technology can harm rather than help. Platforms and algorithms that promised to improve our lives can actually magnify our worst human tendencies. Rogue actors and even governments have taken advantage of user trust to deepen divisions, incite violence, and even undermine our shared sense of what is true and what is false.”", "Despite Apple’s work, the latest revelations show that well-financed state actors of various stripes can find ways through its walls. But as fresh attacks are identified the company seems to do a reasonable job of blocking them.", "Meanwhile, repressive governments in a multitude of hues continue to try to force tech firms to ", ". There are ", ": human rights and democratic dialogue will erode while significant financial, ransomware, and infrastructure attacks would be enabled as information on those designed-in vulnerabilities inevitably spreads.", "NSO Group is an interesting illustration of this. The company invests in identifying vulnerabilities that it should, as a responsible entity, disclose. Instead, it uses these to undermine platform security, then sells those tools to international clients at a profit with what seems to be minimal oversight.", "I see this as a triumph for surveillance capitalism. The company argues that it only deals with “legitimate” government agencies and “firmly denies” Amnesty’s recent claims.", "However, in the ", " and the socially corrosive impact of abuse of social media in the form of ", " and others, alongside the ", " of the entire ‘surveillance as an unregulated private service’ industry, one can’t help but wonder what constitutes a “legitimate” government agency?", "And what happens when government’s change?", "Amnesty International’s Callamard instead says: “The Pegasus Project lays bare how NSO’s spyware is a weapon of choice for repressive governments seeking to silence journalists, attack activists and crush dissent, placing countless lives in peril.”", "In statements that should be a chilling echo for privacy advocates, she adds: “These revelations must act as a catalyst for change. The surveillance industry must no longer be afforded a laissez-faire approach from governments with a vested interest in using this technology to commit human rights violations.”", "Apple seems to agree. Apple's Craig Federighi, senior vice president for software engineering, ", ": “Never before has the right to privacy — the right to keep personal data under your own control — been under assault like it is today. As external threats to privacy continue to evolve, our work to counter them must, too.”", "My take?", "Tools such as those sold at a profit by NSO will enable more criminal and terrorist activity than they prevent.", "The battle to secure the internet and to protect users and their privacy has never seemed so critical, particularly as wider society handles the twin threats of pandemic and climate change."], "url": "https://images.idgesg.net/images/article/2018/02/security_threats_hackers_malware_spyware_phishing_virus_thinkstock_905222206-100749995-large.jpg"},
{"title": "Podcast: Future Mac chips: M1X, M2, M2X and more", "contents": ["Apple's M1 chip is the first in what the company calls a \"family of chips\" that is expected to grow later this year. The next iteration of Apple Silicon, the so-called M1X chip, may arrive in the second half of 2021 and power higher-end Macs. After that, Apple could release an M2 chip, an M2X chip and so on. Macworld executive editor Michael Simon and Computerworld executive editor Ken Mingis join Juliet to discuss future Mac chips, how powerful they may be and what devices will receive the hardware upgrade first."], "url": null},
{"title": "Voice is becoming a primary search technology", "contents": ["If your business isn’t investing in trying to reach the ", ", you should spend time thinking about how to do so, as voice-based search queries deliver locally-based results.", "Ten years since Siri arrived, the voice assistant market is maturing and voice search is beginning to proliferate across multiple devices. Products from Amazon, Google, and Apple all deliver voice assistants and already ", ". Juniper Research ", " by 2022, but the best ads are always native search results.", "John Stine, the executive director ", ", explains: “Voice will soon be a primary way consumers connect to the digital world and a primary way digital marketers will connect with actual consumers…. It’s time to get ready.”", " and the Open Voice Network spoke with 6,000 people in the US, UK, and Germany to figure out how they use their voice assistants. The findings ", ".", "One of the big findings is ubiquity. More than 30% of us now use voice assistants daily, and around 23% of us use them several times a day. Nearly everyone is aware that these things exist.", "The report also provides useful demographic data. I was interested to learn that 60% of users aged 18-24 and 36% of those who are 25-34 years of age are using Siri more than any other assistant. Alexa is more widely used across older demographics, while Google Assistant is also popular. (Cortana and Bixby are very much minor players in the space.)", "This dovetails with a ", " that Apple’s Siri holds 25% of the voice assistant market.", "Privacy remains an issue. It looks as if it will be some time, however, until using these things in public is seen as socially acceptable. Just 27% of US voice assistant users feel comfortable using them in public, which means we rely on them at home, in the car, or on an iPhone when out and about.", "Among those who don’t yet use voice assistants, 42% said concerns about privacy have stopped them doing so, while 32% just don’t trust the assistants.", "That’s not especially surprising given incidents such as when we found ", ". (Apple subsequently made it possible to ", ".)", "Confusion about what our voice assistants can do remains. Most people (76% in the UK) rely on trial and error to find out what they're capable of doing. In other words, while Apple and others in the space regularly introduce support for different types of search, search users are still playing catch up.", "There are some tasks people have become accustomed to. The report states that most of us use Siri and the other assistants to control music (73% of users) and check the weather (80% of users), and confirms 91% of users have searched using voice.", "That last statistic is why every enterprise should work on local search, as those are the results most likely to show up in voice search results. It's also good business, given that 41% of those surveyed already use voice to make purchases.", "There are some differences in behavior between nations: 21% of US consumers say ‘pay a bill’ is their top banking and finance voice-assisted task, compared to 15% in the UK and 17% in Germany. German users, however, are more open to using the technology to find a doctor or specialist than those from the US or UK. ", "James Poulter, CEO & Co-founder of Vixen Labs said: \"Currently there is a lot of white space for [brands] to move into; the customer base is ready and waiting, but in order to tap into this new marketing channel, brands need to optimize, create, and integrate their products and services with voice technology.”", "There are some trends that are pretty easy to guess: The way we search will change, and people will become more habitually accustomed to using voice to search for some things than any other form of search. We’ll also see the results become more personalized as voice assistants get better at figuring out who is speaking.", "Further out, we know voice assistants will become more empathic and capable of responding to the emotion in a person’s voice, and we’ll see new form factors such as ", ". In each case, these will make use of voice as part of the overall interface and will extend the spaces into which use of voice makes sense.", "To get a sense of that future, the best place to look is toward ", " as an area in which the company explores alternative user interfaces. We’re also seeing voice assistants become contextually aware, as well as capable of providing answers to questions ", ".", "We’re also seeing increasing use of voice assistants in business. Enterprise voice assistant architectures such as ", " let business users build their own voice controls to manage their own internal business systems, while apps such as Shortcuts let users extend what their existing voice assistants can do.", "JP Morgan & Co and Capital One both make use of Alexa in client-focused roles, and we are certainly seeing voice deployed in call centers globally – proving a B2C component in supporting customer-focused roles."], "url": "https://images.idgesg.net/images/idge/imported/imageapi/2021/05/24/11/macos-big-sur-siri-100889780-large.jpg"},
{"title": "Biggest tech IPOs of 2021", "contents": ["The 2020 calendar year will long be remembered as an annus horribilis for most, except for a handful of technology companies that reaped the rewards of a global shift to remote work with successful initial public offerings (IPOs).", "US companies alone raised a record $435 billion in stock sales in 2020, with more than a quarter of that figure coming from IPOs — far outstripping 2014's mark of $279 billion, according to data compiled by ", ". The vast majority of those new listings defined themselves as technology companies.", "Cloud-based software firms like Zoom, Snowflake, Asana, Airbnb, and Palantir all ", ", and continue to see their stock price flourish as remote work and e-commerce continue to be the norm for many into 2021.", "The question now is whether this trend will continue through the year. There are a host of companies eying an early debut in 2021 to take advantage of favorable conditions. But, as with all market debuts, timing will be everything, with a number of industry analysts ", " ", " of a ", ".", "Here are the biggest technology IPOs of the year so far.", "NoSQL database specialist Couchbase saw its stock price jump by as much as 39% on its July 22 market debut, valuing the company at more than $1 billion. Initially priced at $24 a share on the Nasdaq exchange, stock in the company jumped to $33.25 a share on its first day of trading, up 38.5%, before settling closer to $30 at the end of the day.", "Couchbase provides managed NoSQL database services and ", ", which had its own blockbuster IPO in 2017 and now boasts a market cap value of $23 billion.", "UK fintech success story Wise floated on the London Stock Exchange on July 7 as a direct listing —meaning no new shares were sold — at a starting price of £8 ($11) per share before rising 10% to £8.88 during its first day of trading. That put the company's value at £8 billion ($11 billion) \\ making it the biggest ever tech float on the LSE.", "Founded by two Estonians and formerly known as TransferWise, the fintech firm is best known for its online international money transfer and cross border payments services.", "Cybersecurity firm SentinelOne closed its June 30 debut on the New York Stock Exchange up 20% at $42.50 per share, well above its expected range of $31 to $32 per share — valuing the company at $10 billion. That far surpassed rival firm CrowdStrike’s blockbuster $6.7 billion debut in 2019.", "Founded in Israel and now based in California, SentinelOne specializes in endpoint security, using machine learning techniques to combat cyberattacks under its Singularity platform product. It competes with the likes of UK-based Darktrace, which also floated this year, and CrowdStrike.", "SentinelOne had raised $267 million on a $3.1 billion valuation just last November, but still runs at a loss, posting a net loss of $64 million in the last quarter.", "Confluent floated at $36 per share on June 23, well above its listing price range of $29 to $33 a share, valuing the company at $9 billion.", "The Mountain View, CA-based company provides customers with an enterprise version of the popular open source Kafka streaming data platform. The technology is used by retailers, automotive makers, ", ", and other enterprises to gain faster insights into their business than traditional \"data at rest\" analytical approaches, and by app developers as a way to power performant event-driven applications.", "Customer experience software maker Sprinklr priced its shares at $16 at its IPO in June, below its target range of $18 to $20, valuing the company at $4 billion.", "Best known for its social media management, advertising, and content marketing tools, Sprinklr counts some of the biggest brands in the world as clients. It had revenues of $387 million for the latest financial year at a net loss of $41 million.", "Israeli workplace management software maker Monday.com floated on the Nasdaq on June 10 at $155 a share, rising to $174 on the first day of trading. That puts the company value at $7.6 billion.", "The cloud-based platform allows companies to create customizable project management tools and ", ", the latter of which had a market cap of $10 billion at the time of the IPO.", "Online job search engine ZipRecruiter floated via a direct listing on the New York Stock Exchange in May, with stock jumping 17% to $21 a share, valuing the company at $2.4 billion.", "Website builder Squarespace floated on the New York Stock exchange via a direct listing in May, with the stock falling 13% on debut to $43.65 per share, valuing the company at $6.4 billion — well below expectations.", "Founded in 2003 by Anthony Casalena as a blog out of his University of Maryland dorm room, the website building and hosting firm is well known to podcast listeners everywhere as its ads became ubiquitous with the medium. The company has also been consistently profitable, pulling in a net income of $30.6 million in the last financial year.", "The rumors were true. ", ", the Swedish-based private equity firm, spun out the Linux distributor ", " in a May IPO on the Frankfurt exchange. The debut itself was fairly muted, with the stock climbing just above its €30 issue price, valuing the company at €5 billion ($6.1 billion).", "Having established itself as an enterprise Linux specialist, SUSE has evolved with the times, now focusing on helping customers navigate the container era, a shift which culminated with the acquisition of Kubernetes specialist Rancher Labs in July 2020.", "UK cybersecurity company Darktrace floated on the London Stock Exchange on Apri 30l, with shares rising by as much as 43% to £3.58 on the first day of trading. That's up from its guide price of £2.50, giving the company a value of around £2.4 billion.", "Founded in 2013 by a group of mathematicians and ex-Intelligence agents, the Cambridge-based firm ", " to analyze enterprise data to help detect and respond to cyber security threats. It generated revenue of almost $200 million in revenue in its latest financial year, running a small profit of $9 million.", "Darktrace is also still ", " with founding investor Mike Lynch, who faces extradition to the US over charges of fraud related to Hewlett-Packard’s $11 billion acquisition of his company Autonomy.", "The cybersecurity company followed in the footsteps of Trustpilot and PensionBee in recent solid tech floats on the London exchange, all of which fared better than food delivery company Deliveroo, which had a disastrous debut.", "UK-based Fintech company PensionBee successfully floated on the London Stock Exchange on April 21, pricing shares at £1.65, somewhere in the middle of its pre-IPO range of £1.55-£1.75. That put the company's value at £365 million.", "The core PensionBee product allows customers to consolidate various pensions into a single plan, accessible through web and mobile apps.", "UiPath closed its first day of trading on the New York Stock Exchange at $69 on April 21, up 23% from its guide price of $52-$54 and valuing the software company at $35.8 billion. The company last raised $750 million in Series F funding in February 2021, at a post-money valuation of $35 billion.", "Founded in Romania in 2005, UiPath specializes in ", " software, which promises to do away with repetitive menial tasks to free up employee time. Customers include the likes of ", ", which used UiPath software to register patients attending COVID-19 testing sites and automatically print labels.", "UiPath has quickly rising revenues, at $608 million for the last financial year, running at a narrowing net loss of $92 million, down from $519.9 million in 2019.", "Coinbase, the company behind the popular cryptocurrency exchange, floated on the Nasdaq on April 14, with shares jumping by as much as 71% on debut, up from its reference price of $250. The stock closed its first day at $328.28, valuing the company at $85.8 billion; that's more than double the market cap of Swiss mining giant Glencore or America’s oldest bank BNY Mellon.", "Coinbase opted for a direct listing instead of a traditional IPO, where no new shares are created and no underwriters are involved — that route has proved popular in the past with tech companies like Spotify, Slack, and Palantir.", "Based in San Francisco, Coinbase has 6 million monthly active users who trade cryptocurrencies like Bitcoin and Ethereum on its platform. The company garnered headlines in 2020 when CEO Brian Armstrong published a ", " banning employees from discussing or engaging with social or political causes. This week, he became one of America’s richest entrepreneurs.", "Coinbase made $1.3 billion in revenue in its last financial year — up from $534 million the previous year — turning a profit of $322 million in 2020 after losing $30 million in 2019, according to a filing with US securities regulators.", "Online learning platform Coursera debuted on the New York Stock Exchange on March 31, closing at $45 which was up 36% from its debut price, valuing the company at $5.9 billion.", "Founded in 2012 by former two computer science professors, Coursera has become a leader in online learning, a market which boomed during the COVID-19 pandemic.", "DigitalOcean had a disappointing ", " on March 24, with its stock sinking 9.6% on its first day. The New York-based cloud firm initially priced its IPO at $47, which was on the top end of the expected range of $44 to $47. It closed its first day at $42.50 a share, valuing the company at $4.5 billion.", "DigitalOcean promises a simple platform for software developers to quickly spin up and host applications in the cloud on virtual private servers (VPS); it competes with the big cloud providers like AWS, Microsoft Azure, Google Cloud, and other Platform as a Service providers such as Heroku, a Salesforce company, and VPS vendors like Linode.", "Like many tech companies at IPO, DigitalOcean is not profitable, having registered a net loss of $44 million on revenue of $318 million in 2020.", "Reviews website ", " floated on the London Stock Exchange on March 23, where its stock surged by as much as 11% on debut, hitting £2.95 a share, up from its offer price of £2.65 ($3.65). That puts the company value at £1.1 billion.", "The Danish firm collates independent reviews for online businesses and counted as many as 120 million reviews by the end of 2020, for everything from utilities providers to yoga studios. It makes money by selling subscriptions to businesses who want to engage with consumer reviews in their marketing campaigns. Its revenue was up 25% in 2020, reaching $102 million at a loss of $12.2 million.", "Food-ordering software maker Olo raised $450 million in an initial public offering on March 17. The New York-based SaaS company sold 18 million shares at $25 each, above its pre-IPO range of $20 to $22, valuing the company at $3.55 billion.", "Olo software powers loyalty programs and allows restaurants to manage orders and menus and currently counts a range of US-based customers including Five Guys, California Pizza Kitchen, and The Cheesecake Factory.", "Utah-based software company Qualtrics went public on Jan. 28, just two years after its $8 billion ", " on the eve of its first planned IPO in 2018.", "Qualtrics initially priced its IPO at $30 per share, which was the top end of its expected range, before popping a massive 52% on its Nasdaq debut. It closed at $45.50 a share, valuing the firm at $27.3 billion.", "Founded by brothers Ryan and Jared Smith alongside their father and fourth co-founder Stuart Orgill, ", " before growing into a platform for large companies like Disney, ", " and ", " to collect a variety of \"experience data\" from employees and customers.", "Qualtrics fared pretty well as part of the SAP family, growing revenue 30% in the first three quarters of 2020 to $550 million. It did continue to operate at a loss of $244 million however, with $218 million of stock-based compensation skewing that number pretty dramatically.", "SAP will maintain majority ownership of the vendor post-IPO, and private equity firm Silver Lake now owns a little over 4% of the stock. Ryan Smith has somewhat stepped away from the day-to-day running of Qualtrics since ", " last year.", "Other companies rumored to be lining up a 2021 IPO include Instacart, ZipRecruiter, Coursera, Bumble, Squarespace, and Coinbase."], "url": "https://images.techhive.com/images/article/2015/09/volitale-up-down-market-stocks-mixed-100613916-large.jpg"},
{"title": "Apple admins get a new remote support option", "contents": ["Apple administrators in the enterprise and education markets now have a new remote access option  thanks to a new integration between ", " and ", ".", "The move means Splashtop, which already has over 30 million users — including many Fortune 500 companies — is now the exclusive default remote support solution included in Addigy. It should be a helpful integration since it lets technicians and admins use Addigy's cloud-based solution for troubleshooting problems remotely.", "That’s particularly invaluable given that ", " means an increasing number of businesses are looking to provide remote tech support to highly distributed teams, sometimes across time zones.", "Given that new practices will ", " when the pandemic eventually ends, it’s a useful tool to have.", "The market for Apple admin products continues to expand. This isn’t especially surprising, given that when given a choice, 59% of enterprise employees ", " — and 79% of all enterprise activity on a mobile device ", ".", "According to a ", ", 71% of high school students prefer using Mac to PC. Additionally, around 81% of individuals admitted that they want to use Macs at work.", "Jason Dettbarn, CEO and founder of Addigy said in a statement: “Addigy technicians can now manage and control their Apple devices remotely as easily as they would in person — quickly addressing their end users’ issues and ensuring their computers are up-to-date and running in optimal condition.”", "These tools mean Apple administrators can:", "Managed Macs are made available in the Addigy console, and a remote session can be launched with a click. Addigy users can also purchase ", " to provide ad-hoc remote support to computers and mobile devices not managed under Addigy.", "In the real world, technicians will be able to access a remote Mac and then take control of the screen, check and manage remote devices using Splashtop.", "We also heard from one user, Creative Techs, whose principal, Tim Pearson, explained how his company uses Addigy to manage several hundred Macs.", "“We have always needed to have remote control of our devices,” he said. “In the past, we used four different methods that we can run at the same time, so if something didn't work, such as VPN being down, we can switch from one tool to another. But in the last couple of years, we've narrowed it down to using Splashtop and Addigy.”", "Noting that his solution is a cross-platform tool, ", ": “Given that this new hybrid work world will almost certainly include a mix of Mac, Windows, iOS and Android devices, businesses need to assess how well their collaboration, communication and remote access tools operate for all these device types.”", "Every enterprise-focused Apple admin services provider is building up to support the emerging remote workplace. Mosyle ", " for admins, while Jamf ", " to make it easier to manage and deploy shared iOS devices in school and enterprise, along with a new ", " that lets enterprise employees use Face ID on their iPhone to open their Mac.", "Meanwhile, with ", ", the Apple/enterprise integration market looks like an increasingly good space to be in."], "url": "https://images.idgesg.net/images/idge/imported/imageapi/2021/07/07/09/macbook-family-2019-100801511-large-100894716-large.jpg"},
{"title": "Patch Tuesday, 'C release' updates to continue for Windows 11", "contents": ["Microsoft has confirmed that the upcoming Windows 11 will be serviced on a monthly basis using the same practices the company has honed with Windows 10.", "In both a ", " and ", ", Microsoft last week said that it would continue to deliver what it had dubbed \"quality updates\" at least twice each month.", "Security updates, commonly known as \"Patch Tuesday\" updates, will be issued on the second Tuesday of each month for both Windows 10 and Windows 11. (Microsoft also calls these the month's \"B releases,\" because it can and to note their second week's appearance.)", "They will remain cumulative, Microsoft said, continuing the practice of Windows 10 from its 2015 launch to include not only all new security fixes but also all previous security ", " non-security updates.", "The other regular update each month Microsoft calls the \"C release,\" both because they come after the Patch Tuesday, or B release updates, and because they are typically issued the third week of each month. These optional updates contain previews of all non-security fixes scheduled to be released in final form the following Patch Tuesday as part of the B release.", "Microsoft offers the C release update so that IT administrators can, if they wish, test the next month's upcoming non-security changes before they arrive as part of the mandatory, cumulative B release approximately three weeks later.", "There are no \"A\" or \"D\" releases in Microsoft's monthly calendar; although the company once offered a D release, it dropped them some time ago.", "More information about each month's updates can be found on the ", " for Windows 10. Microsoft has said that it will post Windows 11 information on this site as well."], "url": "https://images.idgesg.net/images/article/2020/08/hand_flicks_on_update_switch_software_update_fix_patch_by_stadtratte_gettyimages-1140137377_2400x1600-100854510-large.jpg"},
{"title": "Apple: Macs are best choice for enterprise", "contents": ["Apple has gotten very serious about building its ", ", with an ", " explaining the many reasons to move to Mac, supported by a ", " that shows using M1 Macs will save enterprises $843 over three years when compared to a PC.", "The list of advantages include lower running costs, better residual value, security, flexibility, and employee engagement and retention.", "The new research shows a big improvement since a ", " in 2019, when the analysts found that using Macs would save an organization $678 over three years, in contrast to a PC. Savings are even greater with ", ", which Forrester claims deliver $843 cost savings per Mac, from lower cost of deployment, ", ", and increased employee engagement.", "This is very much in line with ", ".", "PC deployment is a high-touch process, the report claims, describing it as being more challenging to manage than Mac deployments and requiring more expensive tech support.", "It is interesting to note how this claim stands beside a previous claim from IBM that it required just one engineer to support 30,000 Macs, but three to support the same quantity of Windows PCs.", "TCO is also boosted by usability. For example, service tickets that were opened for Mac were easier to resolve because there is less complexity with the Mac ecosystem than there is with PCs.", "Additionally, there were fewer hardware-related issues with Macs and fewer dependencies on multiple vendors to perform each task. PCs also provide lower usable life and lower residual value, the report claims.", "“We’re replacing PCs every two to two and a half years while we push a lot of our Macs to four or five-plus years,” one executive told the survey team. (Forrester has not named the executives or companies it spoke with for the report.)", "The ", " explains the cost savings and business benefits enterprises can expect they make the move to Mac, particularly now that the platform uses Apple’s processors. “When the test team got their hands on a MacBook Air M1, they did the test, and it outperformed all the PC devices they had,” a director told Forrester for the report.", "“We’re getting computing power to entry-level positions that is on par with what we used to provide to only our high-end users. So, a lot of extra productivity comes with that,” said a retail industry IT director quoted in the report.", "Forrester found that employee productivity climbs 5% from a move to Mac, and staff retention rates improve by 20%, reflecting improved employee satisfaction. Additional advantages such as support for iOS and iPad apps and Apple’s continued mission to reduce how much energy Macs use also contribute.", "It’s not just a TCO argument. As regular readers will recognize, security, employee performance, and staff retention all benefit when you introduce Macs into your enterprise ecosystem.", "Jamf CEO Dean Hager has said that when given the choice, 75% of enterprise workers will choose a Mac, while 97% of Mac users ", ". IBM says Mac users are ", ".", "The report also finds Macs to be more secure, according to the head of corporate IT in a financial services firm, who said: “We haven’t had any malware incidents in the three years since we moved to a 100% Mac deployment. We can see the traction and retention benefits, the productivity, and the innovation that Macs enable. But, ultimately, we went with Mac for security, and it’s very strong.”", "Apple also published performance benchmarks for M1 Macs to illustrate the extent to which they meet the needs of enterprise users. Apple Silicon Macs deliver twice the Excel and browser graphics performance of Intel models, provide 50% faster web app performance and – most definitely in tune with the times – battery life that is twice as long for Zoom calls. These advantages will only grow as Apple preps the M1X Macs.", "Apple also published a handful of citations from named individuals praising use of Macs in the enterprise:", "“Our employees are more productive, creative and collaborative when they choose the tools they love,” said SAP CIO Florian Roth in a statement now on Apple’s website. “Working on [a] Mac, alongside other devices, inspires personal satisfaction, resulting in best experiences for everyone.”", "“We let employees choose what they use and overwhelmingly they choose Apple products. It enables them to be more productive, and work the way that they want to work,” says Capital One CIO Robert Alexander.", "It’s refreshing to see Apple make a stronger push at the enterprise market. It’s also healthy that the company now feels sufficiently confident to make a case that Macs deliver a lower TCO, along with the computer’s many platform advantages.", "It’s also fair to say that Apple in 2021 has come a long, long way to take a slice of the enterprise market, and is now supported by a vibrant and ", " dedicated to helping business users succeed with its platforms."], "url": "https://images.idgesg.net/images/article/2020/11/m1-mac-mini-display-imovie-100867281-large.jpg"},
{"title": "What's in the latest Chrome update? Faster phishing site warnings, more Actions", "contents": ["Google has released Chrome 92, an upgrade that boosts the browser's performance during anti-phishing calculations, expands the reach of its site isolation technologies and adds some new \"Chrome Actions\" to its repertoire.", "The California-based search giant also paid out more than ", " to those who reported some of the 35 vulnerabilities patched in Chrome 92, which was released last week. At least nine of the bugs were marked \"High,\" Google's second-most-serious threat level. A number of the bounties, including four labeled \"High,\" had not yet been assigned a dollar amount, so Google's final payout will almost certainly top the acknowledged total.", "Because Chrome updates in the background, most users can finish a refresh by relaunching the browser. To manually update, select \"About Google Chrome\" from the Help menu under the three-dot icon at the upper right; the resulting tab shows that the browser has been updated or displays the download process before presenting a Relaunch button. People new to Chrome can ", " for Windows, macOS, and Linux directly. The Android and iOS browsers can be found in the Google Play and App Store markets, respectively.", "Google currently updates Chrome about every six weeks, although the previous version was released May 26. However, Google has said it will accelerate the Chrome release schedule so that by October the ", ".", "Google has been making much of Chrome's lean-in on privacy of late, a response to rivals making hay over stopping trackers from following users as they skip from site to site. Google's stated project, dubbed \"Privacy Sandbox,\" laid down new milestones toward the end of June that put off major action until ", ". While other browser makers have put pedal to the metal on blocking tracking bits, Google said: \"We need to move at a responsible pace.\"", "That there are only minor privacy-specific enhancements to Chrome 92, then, comes as no surprise. One that Google highlighted is a new way to access the rights users have awarded specific websites.", "In Chrome 92 on Android, users can tap the lock icon at the left side of the address bar to open an updated panel, which shows what permissions have been given the active site. Users can toggle those permissions to withdraw the right to, say, access the device's camera.", "The permissions panel will filter to other platforms, including desktop, \"in upcoming releases,\" Google said without getting specific. (This dribble-out practice is a hallmark of Chrome, more so than any other major browser, to some users' frustrations; Google typically cites such staging as appropriately cautious considering the vast number of people who rely on Chrome to reach the Web.)", "Lacking a do-it-now plan to address tracking, Google instead focused users' attention to the browser's work on security, something the search giant is much more comfortable touting.", "High on its list for version 92 was Google's claim of improved performance while conducting anti-phishing tasks. One way Chrome recognizes known phishing sites — those that, say, masquerade as legitimate websites to capture users' credentials — is by ", ". That analysis is done locally — Google said that was a sop to privacy — so performance gains can have a major impact on the browser ", " get results to users faster.", "Google claimed that changes to Chrome 92 resulted in a performance increase of up to 50x, cutting alert arrival times from 1.8 seconds to just 100 milliseconds. Overall, Google contended, the improvements reduce Chrome's overall CPU time by 1.2%.", "\"At Chrome's scale, even minor algorithm improvements can result in major energy efficiency gains in aggregate,\" said Chrome developer Olivier Li Shing Tat-Dupuis in a post to the Chromium Blog.", "Elsewhere in Chrome 92, Google has extended the browser's", " — long a core security component for the browser — to extensions, the add-ons Chrome has popularized.", "\"As of Chrome 92, we will start extending this capability so that extensions can no longer share processes with each other,\" Charlie Reis and Alex Moshchuk, two members of the Chrome security team, wrote in a ", ". \"This provides an extra line of defense against malicious extensions, without removing any existing extension capabilities.\"", "Google has also added additional Chrome Actions, natural language phrases that when typed in the address bar provide shortcuts to various browser settings or functionalities, to version 92. First introduced last November, the list of ", " now includes new entries such as \"safety check,\" \"manage security settings,\" and \"manage sync.\"", "The new actions won't be accessible to everyone immediately, but like so much else in Chrome, will be rolled out gradually to the user base. They were not available in ", "'s copies of Chrome, for example.", "Google will ship Chrome's next upgrade, Chrome 93, on Aug. 31 (or six weeks after v. 92). The first Chrome issued on a four-week interval will be version 95, slated to ship Oct. 19."], "url": "https://images.idgesg.net/images/article/2017/06/pcw-chrome-primary-100724768-large.jpg"},
{"title": "Acronis teams with Jamf to secure the Apple-centric enterprise", "contents": ["As the ", " becomes ", ", there's fresh activity in the Mac security and enterprise infrastructure space: Acronis Cyber Protect Cloud now integrates with leading enterprise management platform Jamf.", "That’s a significant step forward in terms of better native Mac support from ", ", which has been working to widen its support for Apple’s platform ", " when it introduced Mac support for Acronis Access. It’s also a significant indicator that despite the existence of a few hold-outs, most enterprises now recognize that the ", ".", "The latest iteration of ", " integrates with Jamf and is the first Apple integration from Acronis. The idea is that Managed Service Providers (MSP’s) will be able to remotely deploy Acronis’s backup, recovery, security, and endpoint protection using native Jamf tools and workflows.", "\"The Acronis Cyber Protect Cloud integration is tailor-made for MSPs that manage macOS devices on the Jamf platform, helping to establish our credibility and influence in the world of Apple,\" Jan-Jaap \"JJ\" Jager, board advisor and chief revenue officer at Acronis, ", ".", "The company notes that more than half (55%) of all small and medium-sized businesses are Mac friendly, which means there is a growing need for tools of this nature. The support works on both Intel and M1 Macs and is compatible with Jamf’s own security solutions.", "\"We know we are better together as partners, and we worked cooperatively with Jamf to create an integration that is a natural extension of the Jamf Pro platform and uses workflows that are intuitive to Jamf users,\" said Jager. \"This integration creates significant value for macOS admins.”", "\"We are thrilled to welcome Acronis Cyber Protect Cloud to true Apple Enterprise Management for macOS, with this integration that is now available on the Jamf Marketplace,\" said Josh Jagdfeld, senior director of partner marketing at Jamf. \"This integration makes it possible to seamlessly and securely work across devices and platforms. We're so excited to be bringing these two powerful platforms together.”", "The integration makes use of standard enrollment and management methods for Macs. That means service providers can choose their target systems and the solution will automatically deploy Cyber Protect Cloud. They can also manage multiple Jamf Pro accounts from within one single Acronis account. There's a great deal more about ", " available online.", "Cyber Protect Cloud provides full-image and file-level backup and recovery, anti-ransomware, enhanced anti-malware and antivirus capabilities, and a centralized approach to protection management.", "The product is designed to provide IT with powerful security protection and monitoring tools. You use it to identify, monitor, and secure attack surfaces that can attract cybercriminals, such as the growing fleet of Macs in the enterprise.", "However, most companies use multiple approaches to this, which is why Acronis has made it possible to harmonize both Jamf and its own solutions.", "Apple’s software engineering chief, Craig Federighi, recently conceded that Macs aren’t yet as secure as iOS devices. More than 130 different strains of malware have affected as many as 300,000 Macs, he said.", "Now, in the great scale of things that may not seem too bad, given there are around 200 million Macs in use globally. But no company wants to be in the small team of hacked Macs. That’s why integrations such as this new one between Acronis and Jamf make sense.", "The maneuverer comes as activity in the Apple/enterprise space flows at an increasingly rapid rate. Addigy recently reached a ", " with Splashtop; Mosyle ", " for ", "; and Jamf ", " to make it easier to manage and deploy shared iOS devices in school and enterprise — along with a new ", " that brings iOS biometric security to Macs.", "There's also Appogee and Truce Software, who now provide ", " for enterprises. As Truce Software CEO Joe Boyle ", ": “It feels like Apple and the enterprise are practically synonymous today.\"", "And in the wider business ecosystem we see more supporting technologies being brought to bear from across the space, prompting established names such as ", ", ", ", ", ", ", ", ", ", and others to ramp up available apps and services for Apple’s platforms.", "Apple recognizes its growing reach into enterprise IT. The company introduced a range of ", " to its offer to the sector at WWDC 21, reflecting its embrace of partnerships in an attempt to empower use in the enterprise.", "“We’ve put [a lot] into the operating systems to make that process of bringing these devices into the office or now taking them back out to your house, but doing work on them as easy as possible for IT,” ", ", Apple’s enterprise and education product manager, in 2020."], "url": "https://images.idgesg.net/images/article/2017/08/acronis_true_image_2017-100732472-large.jpg"},
{"title": "The most important Chrome OS feature of 2021 isn't coming from Google", "contents": ["Well, I'll be. For all the ", " and ", " Google's constantly cookin' up for its Chrome OS platform, the most eye-opening Chromebook change of the year isn't even coming from within Google's walls.", "In fact, it's coming from one of Google's biggest, fiercest competitors — a company that'd very much like to see Chromebooks fizzle out and fade away.", "Don't you just love inadvertent irony?", "The change of which we speak stems from a recent announcement by Microsoft — yes, Microsoft! — and it technically has nothing to do with Chrome OS at all, even. In fact, amidst all the chatter about what the change means for Microsoft and its world of Windows, I haven't seen anyone so much as mention the potential significance here in the land o' Chrome OS computers.", "But my, oh my, you'd better believe this could make a monumental difference for Chromebooks and the land-roaming mammals who use 'em. And more than likely in a ", "good way.", "Let me back up for a second and explain. Last week, Microsoft ", " a new ", ". In a nutshell, it's a version of Windows that runs entirely in the cloud and thus can be used on more or less any computer (or even mobile device). Using it is akin to using your own personal Windows desktop, with all of your apps, data, and settings intact, only it works and is available on any ol' screen where you pull it up in a browser.", "That means Microsoft could conceivably let people ", "businesses buy cheap terminal-like laptops — kind of like the original Chromebooks, way back in Chrome OS's ", " — without any of the resource requirements typically needed for a decent Windows experience. In a sense, that could make this a way for Microsoft to better compete with Google when it comes to offering a simple, affordable, and hardware-agnostic computing experience where you can move from one device to the next without losing a thing or having to deal with any time-consuming setup processes.", "Peachy, right? Sure. But in the twist most folks haven't chewed over, it could ", " mean you'll have a new universally available and exceptionally easy-to-implement option for running Windows on a ", "— and thus accessing all the types of traditional desktop programs that aren't typically available in the Chrome OS environment.", "Now, for most average Homo sapiens carrying around a Chrome OS device, this probably won't make a lick of difference. Chrome OS has gotten ", " on its own over the years, thanks to Google's ongoing efforts to flesh the platform out and expand ", " it's able to support.", "But there's an exception — and it's an especially nagging one in the cash-oozing land o' the enterprise, where Google would love to see Chrome OS make more inroads: Businesses frequently have super-specific traditional PC tools they rely on for day-to-day work. Whether they're advanced graphic utilities or custom-made desktop management systems, there's no shortage of \"legacy apps\" out there that still don't operate in the web/Android/Linux-app-centric realm of Chrome OS.", "See where this is going?", "Microsoft, in a way, just addressed that void and made Chromebooks viable for a whole new audience of potential users — folks who were ", " to being able to get by with the cloud-centric Chrome OS approach but who still had a handful of lingering traditional-desktop needs. Now, those sorts of humans can carry around Chromebooks and get 95% of what they need done within that fast, simple, low-maintenance and high-security environment. And when they need one of their legacy programs, by golly, they can just pull up Windows in the browser and get to it right then and there.", "It'll be the best of both worlds, in other words — all of the advantages of a Chromebook combined with the on-demand capabilities of a traditional Windows system.", "Now, to be clear, this kind of setup isn't technically new. Heck, even Google itself started ", " to pull up a virtual Windows desktop on a Chromebook and ", " last year. But, well, a couple things: Despite its official Google support, that system relies on a third-party partnership (with a company called Parallels). And it's fairly out of sight, too. I mean, really: How many folks even realize it's an option?", "Microsoft's offering, on the other hand, comes straight from the Windows mecca — a company most enterprises are certainly accustomed to thinking about and working with on technology. And it'll be a simple-seeming part of any existing Microsoft enterprise arrangement, with no direct tether to any one specific device. A company sets up the plan, gets the experience going, and can then allow its worker-bees to buzz around their virtual Windows honey-hives from any computer, anytime.", "Just like Google's Windows-on-Chrome-OS arrangement, that eliminates any remaining asterisks as to why a Chromebook might not be viable for any given situation. It erases the platform's remaining limitations, especially on the enterprise level, and completes Chrome OS's evolution into the true \"everything\" platform — a place where you can run all sorts of web-centric apps alongside Android apps, Linux apps, and now even ", " apps without so much as thinking about the programs' underlying origins. And it makes that option easier than ever.", "As I put it when Google first broached this area with its Parallels-partnering program:", "[A Chromebook will now] run practically anything imaginable, including those enterprise-specific holdouts, and it'll do it in a low-cost, low-maintenance, and low-security-risk environment that's made for large-scale management.", "For enterprises, that means the intriguing option they've perhaps considered but couldn't quite justify before will suddenly be viable. For Google, that means the lucrative business market it's been trying to break into with Chrome OS will suddenly be attainable. And for regular ol' individual users of Chromebooks, it means the platform could suddenly start seeing a huge new injection of large-scale interest — which has the potential to trickle down and lead to even more hardware diversity and software development across all areas.", "Now all of that is about to happen on an even broader scale, with Microsoft itself acting as the official (and very visible) provider. Mark my words: This could be absolutely ", " for Chrome OS and its growth into the enterprise, especially if Google embraces the move and finds a way to position it properly.", "Most fascinating of all, though, is the fact that this could be every bit as beneficial for Microsoft. Microsoft, after all, has been in the midst of pivoting toward a service- and subscription-based business for ", " now, and when you really stop and think about it, getting people to ", "to use Windows while also owning a Chromebook is a pretty brilliant plan. Microsoft has effectively found a loophole that allows it to build a lucrative business on top of Google's Chromebook success instead of trying to go up against it.", "From multiple levels, this truly could be the biggest, most significant change coming to Chrome OS this year — or maybe even ever. Once more, lines are a-blurrin' and worlds are colliding. And for those of us who actually use these devices and the ecosystems around 'em, my goodness, is it ever a fascinating new pool of possibilities to ponder."], "url": "https://images.idgesg.net/images/article/2021/07/chrome-os-google-100896879-large.jpg"}
]